import { useState, useEffect } from 'react'

import DataGrid, { TextEditor, Row, RowRendererProps } from 'react-data-grid';

const solutions = [
    "попереднє навчання членів проектного колективу",
    "узгодження детального переліку вимог до ПЗ із замовником",
    "внесення узгодженого переліку вимог до ПЗ замовника в договір",
    "точне слідування вимогам замовника з узгодженого переліку вимог до ПЗ",
    "попередні дослідження ринку",
    "експертна оцінка програмного проекту досвідченим стороннім консультантом",
    "консультації досвідченого стороннього консультанта",
    "тренінг з вивчення необхідних інструментів розроблення ПЗ",
    "укладання договору страхування", 
    'використання "шаблонних" рішень з вдалих попередніх проектів при управлінні програмним проектом',
    'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника',
    'реорганізація роботи проектного колективу так, щоб обов\'язки та робота членів колективу перекривали один одного',
    'придбання (замовлення) частини компонент розроблюваного ПЗ',
    'заміна потенційно дефектних компонент розроблюваного ПЗ придбаними компонентами, які гарантують якість виконання роботи',
    'придбання більш продуктивної бази даних',
    'використання генератора програмного коду',
    'реорганізація роботи проектного колективу залежно від рівня труднощів виконання завдань та професійних рівнів розробників',
    'повторне використання придатних компонент ПЗ, які були розроблені для інших програмних проектів',
    'аналіз доцільності розроблення даного ПЗ'
]

const columns = [
    { key: 'id', name: 'ID', width: 50 },
    { key: 'code', name: '', width: 50 },
    { key: 'riskName', name: 'Ризикові події', width: 800 },
    {
        key: 'solution',
        name: 'Рішення',
        editor: (p) => (
          <select
            autoFocus
            value={p.row.country}
            onChange={(e) => p.onRowChange({ ...p.row, solution: e.target.value }, true)}
          >
            {solutions.map((solution) => (
              <option key={solution}>{solution}</option>
            ))}
          </select>
        ),
        editorOptions: {
          editOnClick: true
        }
      },
];

const RiskMedigation = () => {
    
    const [rows, setRows] = useState([
        { id: 1, code: 't1', riskName: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ' },
        { id: 2, code: 't2', riskName: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ' },
        { id: 3, code: 't3', riskName: 'небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ' },
        { id: 4, code: 't4', riskName: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ' },
        { id: 5, code: 't5', riskName: 'відмова команди виконавців від CASE-засобів розроблення ПЗ' },
        { id: 6, code: 't6', riskName: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ' },
        { id: 7, code: 't7', riskName: ' неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення П' },
        { id: 8, code: 't8', riskName: ' недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ' },
        { id: 9, code: 't9', riskName: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості' },
        { id: 10, code: 't10', riskName: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів' },
        { id: 11, code: 't11', riskName: 'поява дефектних системних компонент, які використовують для розроблення ПЗ' },
        { id: 12, code: 'c1', riskName: 'недооцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)' },
        { id: 13, code: 'c2', riskName: 'переоцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)' },
        { id: 14, code: 'c3', riskName: 'фінансові ускладнення у компанії-замовника ПЗ' },
        { id: 15, code: 'c4', riskName: 'фінансові ускладнення у компанії-розробника ПЗ' },
        { id: 16, code: 'c5', riskName: 'зменшення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації' },
        { id: 17, code: 'c6', riskName: 'збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації;' },
        { id: 18, code: 'c7', riskName: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ' },
        { id: 19, code: 'c8', riskName: 'реорганізація структурних підрозділів у компанії-замовника ПЗ' },
        { id: 20, code: 'c9', riskName: 'реорганізація команди виконавців у компанії-розробника ПЗ' },
        { id: 21, code: 'p1', riskName: 'зміни графіка виконання робіт з боку замовника чи виконавця' },
        { id: 22, code: 'p2', riskName: 'порушення графіка виконання робіт у компанії-розробника ПЗ' },
        { id: 23, code: 'p3', riskName: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ' },
        { id: 24, code: 'p4', riskName: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ' },
        { id: 25, code: 'p5', riskName: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ' },
        { id: 26, code: 'p6', riskName: 'недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ' },
        { id: 27, code: 'p7', riskName: 'переоцінювання тривалості етапів реалізації програмного проекту' },
        { id: 28, code: 'p8', riskName: 'остаточний розмір ПЗ перевищує заплановані його характеристики' },
        { id: 29, code: 'p9', riskName: 'остаточний розмір ПЗ значно менший за планові його характеристики' },
        { id: 30, code: 'p10', riskName: 'поява на ринку аналогічного ПЗ до виходу замовленого' },
        { id: 31, code: 'p11', riskName: 'поява на ринку більш конкурентоздатного ПЗ' },
        { id: 32, code: 'm1', riskName: 'низький моральний стан персоналу команди виконавців ПЗ' },
        { id: 33, code: 'm2', riskName: 'низька взаємодія між членами команди виконавців ПЗ' },
        { id: 34, code: 'm3', riskName: 'пасивність керівника (менеджера) програмного проекту' },
        { id: 35, code: 'm4', riskName: 'недостатня компетентність керівника (менеджера) програмного проекту' },
        { id: 36, code: 'm5', riskName: 'незадоволеність замовника результатами етапів реалізації програмного проекту' },
        { id: 37, code: 'm6', riskName: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем' },
        { id: 38, code: 'm7', riskName: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ' },
        { id: 39, code: 'm8', riskName: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ' },
        { id: 40, code: 'm9', riskName: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ' },
        { id: 41, code: 'm10', riskName: 'зміна пріоритетів у процесі управління програмним проектом' },
        { id: 42, code: 'm11', riskName: 'недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ' },
        { id: 43, code: 'm12', riskName: 'переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ' },
        { id: 44, code: 'm13', riskName: 'надмірне документування результатів на етапах реалізації програмного проекту' },
        { id: 45, code: 'm14', riskName: 'недостатнє документування результатів на етапах реалізації програмного проекту' },
        { id: 46, code: 'm15', riskName: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту' },
        { id: 47, code: 'm16', riskName: 'недостатній професійний рівень представників від компанії-замовника ПЗ' },
    ]);

    function rowKeyGetter(row) {
        return row.id;
    }
    
    return (<div>
        <DataGrid columns={columns} rows={rows} rowKeyGetter={rowKeyGetter} onRowsChange={setRows} />
    </div>  );
}
 
export default RiskMedigation;